Tekla Open API Reference for Tekla Structures 2025
PlacingTypes.PointPlacing Method
 The object is placed at one point (the insertion point) without any additional placing options.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static PlacingBase PointPlacing()
Public Shared Function PointPlacing As PlacingBase
Return Value
Type: PlacingBase
A new point placing instance.
See Also
Reference
PlacingTypes Class
Tekla.Structures.Drawing Namespace